hospital-app/app/controllers/doctors_controller.rb

    def show
        @doctor = Doctor.find(params[:id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]