hospital-app/app/controllers/patients_controller.rb

  def show
    @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @patient = Patient.new(patient_params)
    if @patient.save
---
INSERT INTO "patients" ("first_name", "last_name", "diagnosis", "born_on", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Afnan"], ["last_name", "Basudan"], ["diagnosis", "sleep"], ["born_on", "1996-06-24"], ["created_at", "2020-03-30 16:23:23.076464"], ["updated_at", "2020-03-30 16:23:23.076464"]]

  def edit
    @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    patient = Patient.find(params[:id])
    patient.update(patient_params)
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "patients" SET "born_on" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["born_on", "2000-12-30"], ["updated_at", "2020-03-30 16:49:35.737393"], ["id", 1]]