app/controllers/patients_controller.rb

INSERT INTO "patients" ("first_name", "last_name", "diagnosis", "born_on", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Somayah"], ["last_name", "Babder"], ["diagnosis", "flue"], ["born_on", "1988-07-14"], ["created_at", "2020-03-30 21:33:10.408143"], ["updated_at", "2020-03-30 21:33:10.408143"]]
---
        def create
            @patient = Patient.new(patient_params)
            @patient.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
        def edit
            @Patient = Patient.find(params[:id])

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "patients" SET "first_name" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["first_name", "lolo2"], ["updated_at", "2020-03-31 05:07:06.789839"], ["id", 7]]
---
          def update
            @patient = Patient.find(params[:id])
            if @patient.update(patient_params)

DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 7]]
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          def destroy
            @patient = Patient.find(params[:id]).delete